# Задача 2: Найдите сумму цифр трехзначного числа.
# *Пример:*
# 123 -> 6 (1 + 2 + 3)
# 100 -> 1 (1 + 0 + 0) 

sum = int(input("Введите число: "))

a = sum % 10
b = sum // 10 % 10
c = sum // 100

print(f"Результат:{a+b+c}")