# Задача 4: Петя, Катя и Сережа делают из бумаги журавликов. 
# Вместе они сделали S журавликов. 
# Сколько журавликов сделал каждый ребенок, если известно, 
# что Петя и Сережа сделали одинаковое количество журавликов, 
# а Катя сделала в два раза больше журавликов, чем Петя и Сережа вместе?

# *Пример:*

# 6 -> 1  4  1
# 24 -> 4  16  4
#     60 -> 10  40  10

sum = int(input("Введите число журавликов: "))

p = (sum // 3)/2
s = p
k = (s + p)*2

print(f"Петя сделал {p} журавликов")
print(f"Катя сделала {k} журавликов")
print(f"Сережа сделал {s} журавликов")

print("Вариант с округлением")

print(f"Петя сделал {round(p)} журавликов")
print(f"Катя сделала {round(k)} журавликов")
print(f"Сережа сделал {round(s)} журавликов")

