# Задача No17. Решение в группах
# Дан список чисел. Определите, сколько в 
# нем встречается различных чисел.
# Input: [1, 1, 2, 0, -1, 3, 4, 4] Output: 6

# a = [1, 1, 2, 0, -1, 3, 4, 4]

# print(len(set(a)))


# mass = input().split(", ")
# new_mass = []
# for i in mass:
#     if i not in new_mass:
#         new_mass.append(i)
# count = len(new_mass)
# print(count)


# Задача No19. Дана последовательность из N целых 
# чисел и число K. Необходимо сдвинуть всю 
# последовательность (сдвиг - циклический) 
# на K элементов вправо, K – положительное число.
# Input: [1, 2, 3, 4, 5] k = 3 Output: [4, 5, 1, 2, 3]

# arr = [1, 2, 3, 4, 5]
# k = 3
# arr = arr[k:] + arr[:k]
# print(arr)

# lst = [1, 2, 3, 4, 5]
# k = 2
# for i in range(k):
#     lst.insert(0, lst.pop(-1))
# print(lst)



# Задача No21.Напишите программу для печати всех уникальных значений в словаре.
# Input: [{"V": "S001"}, {"V": "S002"}, {"VI": "S001"}, {"VI": "S005"}, 
#         {"VII": " S005 "}, {" V ":" S009 "}, {" VIII ":" S007 "}]
# Output: {'S005', 'S002', 'S007', 'S001', 'S009'}

# a = [{"V": "S001"}, {"V": "S002"}, {"VI": "S001"}, {"VI": "S005"}, {"VII": " S005 "}, {" V ":" S009 "}, {" VIII ":" S007 "}]
# s = set()
# for i in a:
#     s.add(*i.values())
# print(*s)



# Задача N24.Дан массив, состоящий из целых чисел. Напишите программу, 
# которая подсчитает количество элементов массива, больших предыдущего 
# (элемента с предыдущим номером)
# Input: [0, -1, 5, 2, 3] Output: 2 (-1 < 5, 2 < 3)

# k = 0
# n = int(input())
# a = map(int, input().split())
# a = list(a)
# for i in range(1, len(a)):
#     if a[i] > a[i - 1]:
#         k += 1
# print(k)


# list = [0, -1, 5, 2, 3]
# i = 1
# sum = 0

# while i < len(list):
#     if list[i] > list[i - 1]:
#         sum = sum + 1
#     i = i + 1

# print(sum)



# Супер быстрый калькулятор в одну строчку 
# while True: print(eval(input("Введите числа:_"))) 